In [3]:
import pandas as pd
import numpy as np

In [4]:
np.random.randint(1,20,(5,4))

array([[ 4,  7,  1, 16],
       [19, 17, 16,  5],
       [10, 12,  9, 10],
       [10,  4,  3, 11],
       [ 1, 12, 11, 18]])

In [24]:
df = pd.DataFrame(np.random.randint(1,20,(5,4)),['A','B','C','D','E'],['X','Y','Z','W'])
df

    X   Y   Z   W
A   4   7   2   9
B  14  15  14  11
C  11  19   1  17
D   6   3  11  18
E  15  16  13  16

In [25]:
df[['X','Y']]

    X   Y
A   4   7
B  14  15
C  11  19
D   6   3
E  15  16

In [26]:
type(df['X'])

pandas.core.series.Series

In [27]:
df['New'] = df['X']+df['Y']
df.head(3)

    X   Y   Z   W  New
A   4   7   2   9   11
B  14  15  14  11   29
C  11  19   1  17   30

In [28]:
df.drop('New',axis=1,inplace=True) #deleting column
df

    X   Y   Z   W
A   4   7   2   9
B  14  15  14  11
C  11  19   1  17
D   6   3  11  18
E  15  16  13  16

In [29]:
df.drop('E',inplace=True) #deleting row
df

    X   Y   Z   W
A   4   7   2   9
B  14  15  14  11
C  11  19   1  17
D   6   3  11  18

In [30]:
#selecting rows 
df.loc['A']   #labelled indexing

X    4
Y    7
Z    2
W    9
Name: A, dtype: int32

In [33]:
df.iloc[0] #numeric indexing

X    4
Y    7
Z    2
W    9
Name: A, dtype: int32

In [40]:
df.loc[['A','B'],['Z','W']]  #selecting multiple values using loc

    Z   W
A   2   9
B  14  11